---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerCannotBeSloped
source: html/0366bd7b-f2dd-412c-c467-320484fb0d1b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerCannotBeSloped Property

A hanger cannot be sloped or placed on a sloped element.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationHangerCannotBeSloped { get; }
```